from itertools import product
letters = sorted("ЦВЕТОК")

counter = 0

for index, comb in enumerate(product(letters, repeat=6), start=1):
    word = "".join(comb)

    if index % 2 == 1 and word.count("Т") == 2 and word.count("Ц") == 1 and (word.count("К") == 0 and word.count("В") == 0 and word.count("Е") == 0):
        counter += 1

print(counter)







"""
Все шестибуквенные слова, составленные из букв Ц, В, Е, Т, О, К, записаны в алфавитном порядке и пронумерованы.
Вот начало списка:
1. BBBBBB
2. ВВВВВЕ
3. ВВВВВК
4. ВВВВВО
5. ВВВВВТ
6. ВВВВВЦ
Определите в этом списке количество слов с нечётными номерами, в записи которых не содержится ни одной из букв В, Е или К и при этом имеется ровно две буквы Т и ровно одна буква Ц.
Примечание. Слово - последовательность идущих подряд букв, не обязательно осмысленная.
"""