for N in range(1, 10000):
    bin_N = bin(N)[2:]

    if N % 2 == 0:
        bin_N = "10" + bin_N
    else: 
        bin_N = "1" + bin_N + "01"
    
    R = int(bin_N, 2)
    if R >= 190:
        print(N)
        break







"""
На вход алгоритма подаётся натуральное число N. Алгоритм строит по нему новое число R следующим образом.
1. Строится двоичная запись числа N.
2. Далее эта запись обрабатывается по следующему правилу:
а) если число чётное, то к двоичной записи числа слева дописывается 10;
б) если число нечётное, то к двоичной записи числа слева дописывается 1 и справа дописывается 01.
Полученная таким образом запись является двоичной записью искомого числа R.
3. Результат переводится в десятичную систему и выводится на экран.
Например, для исходного числа 410 = 100, результатом является число 2010 = 101002, а для исходного числа 510 = 1012 это число 1101012 = 5310.
Укажите минимальное число N, после обработки которого с помощью этого алгоритма получается число R, не меньшее 190. В ответе запишите это число в десятичной системе счисления.
"""